create database pjFilm
go

use pjFilm
go
Create table UserInformation				--用户信息表
(
UIID int primary key identity(1,1),
Name nvarchar(max) not null,								--称号名
[Password] nvarchar(max) not null,					--密码
loginName nvarchar(max) not null,						--账号
[Age] nvarchar(max) not null,				--年龄 check(Age=18) 
Gender nvarchar(max) not null,				--性别
Telephone nvarchar(max) not null,			--电话
qq nvarchar(max) not null,					--QQ
Mailbox nvarchar(max) not null,				--邮箱
SecurityID int not null,					--密保编号
[delete] int not null check([delete]=0),	--删除,不是删除为0，删除为1
StateID int not null check(StateID=0)		--外键
)

select * from UserInformation

Insert into UserInformation([Name],[Password],[loginName],[delete],[StateID]) values('k','143114','1431533387','','')



Create table [Type]										--类型表
(
ID int primary key identity(1,1),
StateName nvarchar(20) not null,						--类型名称
MIID int not null,								--类型编号
[delete] int not null check([delete]=0),				--删除
StateID int not null check(StateID=0)					--外键
)
insert into [Type] values('动作','101','0','')
insert into [Type] values('喜剧','102','0','')
insert into [Type] values('爱情','103','0','')
insert into [Type] values('科幻','104','0','')
insert into [Type] values('剧情','105','0','')
insert into [Type] values('恐怖','106','0','')
insert into [Type] values('战争','107','0','')
insert into [Type] values('记录','108','0','')
go
select * from type

Create table [Security]						--密保表
(
SecID int primary key identity,
Secret nvarchar(250) not null,				--密保问题
SecretAnswer nvarchar(250) not null,		--密保答案
SecurityID int not null,					--密保编号
[delete] int not null check([delete]=0),	--删除
StateID int not null check(StateID=0)		--外键
)
go


Create table MovieInformation				--电影信息表
(
MIID int primary key identity,
MovieName nvarchar(max) not null,			--电影名
Performer nvarchar(max) not null,			--演员名
Region nvarchar(max),						--地区
ParticularYear datetime,					--年份
UpdateDate datetime,						--更新日期
Plotintroduction nvarchar(max),				--剧情介绍
PictureNumber int not null,					--图片编号
StateNameID int not null,					--类型编号
LinkID int not null,						--链接编号
Statname int not null,						--状态编号
[delete] int not null check([delete]=0),	--删除
StateID int not null check(StateID=0)		--外键
)
select * from dbo.MovieInformation
--动作116
insert into MovieInformation values('侠盗联盟BD高清国语中字','刘德华 / 舒淇 / 张静初 / 杨祐宁 ','中国','2017','2017/10/15 0:58:54','江洋大盗张丹（刘德华 饰）在一次行动中遭遇黑吃黑，失手被擒入狱。三年后，出狱的张丹会合老搭档小宝（杨祐宁 饰），与新入伙的叶红（舒淇 饰）联手，在追捕自己多年的法国警探皮埃尔（让?雷诺 饰）眼皮底下盗窃得手。 　　小试身手之后，张丹找到宝物的买家——与自己情同父子的犯罪组织头目金刚（曾志伟 饰），二人重逢之后，张丹接到新的任务。与此同时，为将张丹一伙人捉拿归案，皮埃尔说服对张丹因爱生恨的前女友Amber（张静初 饰）加入追捕行动。 　　从戛纳到布拉格，跨越欧洲大陆的猫鼠游戏正激烈上演。几次短兵相接后，张丹的行踪逐渐被皮埃尔掌握。而随着一行人接近终极目标，张丹的真实计划也逐渐浮出水面……','998','101','100001','201','0','')
insert into MovieInformation values('蜘蛛侠：英雄归来BD高清中英双字','汤姆·霍兰德 / 小罗伯特·唐尼 / 玛丽莎·托梅 / 迈克尔·基顿 / 雅各布·巴特朗','美国','2017','2017/9/28 0:04:57','彼得帕克（汤姆·赫兰德 Tom Holland 饰）在内战后受到了钢铁侠托尼斯塔克（小罗伯特·唐尼 Robert Downey Jr. 饰）的赏识，表面上，彼得进入托尼的公司成为了一名实习生，实际上，他和复仇者联盟的成员们一起接受了各种各样的训练。托尼虽然欣赏彼得的勇敢和正直，却并不认为他目前已经拥有加入复联的实力，他派出了特工哈皮（乔恩·费儒 Jon Favreau 饰）暗中观察，这让十分想证明自己的彼得感到万分焦躁。 　　在对付两个银行劫匪的过程中，彼得发现劫匪们使用的是一种前所未见的新型武器，他孤身一人深入敌后顺藤摸瓜找到了幕后主使秃鹰（迈克尔·基顿 Michael Keaton 饰），让他彼得没有想到的是，秃鹰竟然是他爱慕的女生利兹（劳拉·海瑞尔 Laura Harrier 饰）的父亲.','999','101','100002','201','0','')
insert into MovieInformation values('超速驾驶BD高清中英双字','斯科特·伊斯特伍德 / 安娜·德·阿玛斯 / 盖亚·维斯 / 克雷蒙斯·施伊克 / 西蒙·阿布卡瑞安','','2017','2017/10/10 0:03:56','影片《Overdrive》的主角聚焦两位偷车贼兄弟。兄弟俩一路来到法国南部，准备寻求新的机会大干一票，没想到却卷入了当地犯罪地头蛇的一场风波之中。','1011','101','100003','201','','')
insert into MovieInformation values('黑暗塔BD高清中英双字','马修·麦康纳 / 伊德里斯·艾尔巴 / 汤姆·泰勒 / 丹尼斯·海斯伯特 / 本·加文','美国','2017','2017/10/10 0:05:32','影片讲述了枪侠罗兰·德鄯为了将自己居住的世界与其他世界相连，修复连接光束，阻止世界迅速消亡，而寻找黑暗塔的故事.','1012','101','100004','201','','')
insert into MovieInformation values('狙击精英：巅峰对决BD高清中英双字','查德·科林斯 / 乔·兰多 / 丹妮·加西亚 / 比利·赞恩 / 汤姆·贝伦杰','美国','2017','2017/10/9 0:05:28','哥伦比亚毒枭杰西·莫拉莱斯暗中雇佣了一个职业狙击手，约翰·萨姆森（乔·兰多 Joe Lando 饰），人称“恶魔”。他的工作就是帮他的雇主消灭所有的威胁。在所有的竞争对手都一一被杀之后，莫拉莱斯变的十分强大，几乎垄断了整个毒品市场，并且控制了更多的直通美国的走私线路。在情况愈发危急之 时，美国缉毒局派出了一直苦苦调查并且坚持了多年的凯特·埃斯特拉达探员（丹妮·加西亚 Danay Garcia 饰）追捕莫拉莱斯。为了更好地消灭“恶魔”萨姆森，美军也派出了狙击手布兰登·贝克特（查德·科林斯 Chad Collins 饰），“双狙人”托马斯·贝克特（汤姆·贝伦杰 Tom Berenger 饰）的儿子。在政府认为他们已经控制了一切之后，莫拉莱斯和萨姆森也准备了大量的“惊喜”来欢迎所有的敌人......','1013','101','100005','201','','')
insert into MovieInformation values('追龙2017.HDTC清晰国语中字','甄子丹 / 刘德华 / 姜皓文 / 郑则仕 / 刘浩龙','香港','2017','2017/10/2 0:04:20','电影讲述了香港现代史上两大著名狠角色大毒枭跛豪（甄子丹饰）、五亿探长雷洛（刘德华饰）的传奇故事。 　　上世纪六七十年代，香港由英国殖民，权势腐败、社会混乱。1963年，穷困潦倒的青年阿豪（甄子丹饰）偷渡至香港，抱着“生死有命、富贵在天”之心决意一搏人生。阿豪带着几个兄弟，从九龙城寨底层开始一路刀刃舔血，爬上香港毒品霸主之位，一手掌控香港十大黑帮，江湖人称“跛豪”。而雷洛（刘德华饰）则从一位普通探长一步步爬上华人总探长高位，统领全香港三万警察，手握香港治安“潜规则”。为垄断香港黄赌毒三大经济产业，跛豪与雷洛结拜为兄弟，两人一黑一白两手遮天，权势滔天，家财亿万，独霸香港岛……','1014','101','100006','201','','')
insert into MovieInformation values('英伦对决HDTS清晰国语中字','成龙 / 皮尔斯·布鲁斯南 / 刘涛 / 梁佩诗 / 夏莉·墨菲','中国','2017','2017/10/8 0:01:33','关玉明(成龙饰)年轻时打过越战,当过特种兵。但如今,他敛尽锋芒,在英国伦敦唐人街开了一家小餐馆,与女儿(梁佩诗 饰)相依为命。在一次恐怖袭击中,女儿不幸遇难。英国有关部门的不作为更使他悲愤莫名,这时,关键人物汉尼斯(皮尔斯布 ·鲁斯南饰)出现在他的视野之中,担任政府高官的他当年曾与恐怖分子有千丝万缕联系。曾经在战争中出生入死的经验,让关玉明敏锐地察觉,汉尼斯手中一定有此次恐怖袭击的资料。于是,关玉明几次登门请求汉尼斯为自己提供线索,但遭到汉尼斯的拒绝。万念俱灰的关玉明决定用自己的方式为女儿报仇雪恨。为此,他拒绝了爱人林宝怡(刘涛饰)的挽留,独自踏上向恐怖组织以牙还牙以血还血的复仇之路。但他并不知道的是,一个错综复杂的大阴谋正在他面前徐徐展开 ...','1015','101','100007','201','','')
insert into MovieInformation values('破·局BD高清国语中字','郭富城 / 王千源 / 刘涛 / 余皑磊 / 冯嘉怡','中国','2017','2017/10/10 0:02:58','这是高见翔警官生命中最艰难的一天：母亲去世，工作遇阻，还在奔丧时意外撞死了一个人。他本以为可以瞒天过海，没想到一个惊天阴谋在前方等待，令他身陷迷局......','1016','101','100008','201','','')
insert into MovieInformation values('美国行动[韩版]HD高清修正中英双字','汤姆·克鲁斯 / 多姆纳尔·格里森 / 罗拉·科克 / 杰西·普莱蒙 / 杰玛·梅斯','美国','2017','2017/10/22 0:03:29','《美国行动》取材于美国大毒枭巴里·希尔（Barry Seal）的真实经历。阿汤哥在影片中身兼飞行员、毒枭、CIA卧底三重身份，表面上在为美国中情局工作，利用飞行员身份频繁往返于美洲各个国家窃取情报；同时又为美洲历史上最臭名昭著的国际贩毒集团——麦德林集团向美国走私毒品，单枪匹马开拓出从美洲丛林腹地空运毒品到美国境内的“新航线”。在美洲瞬息万变的政治格局之下，巴里·希尔毫无意外地卷入当时敏感又复杂的国际政治博弈中，每天与情报、枪支、毒品、洗钱种种犯罪行为打交道，同时又周旋在美国政府、军方、FBI以及美洲非政府武装之间，与他们有着错综复杂的关系，建立起令人难以想象的“空中走私帝国”。','1017','101','100009','201','','')
insert into MovieInformation values('心理罪BD高清国语中字','廖凡 / 李易峰 / 万茜 / 李纯 / 张国柱','中国','2017','2017/10/8 0:02:37','一杯人血牛奶，为何会对人产生致命诱惑？什么样的扭曲心理才会为之痴狂，甚至不惜接二连三，连环杀人？非同寻常的杀手，超越常理的罪案，需要非同一般的警探。年轻气盛的犯罪心理学高材生方木（李易峰 饰）出手相助，却被卷入其中；身手不凡的野兽派刑警队长邰伟（廖凡 饰）嫉恶如仇，却难以走出内心泥沼。两人联手，却成绝妙拍档！一场身手的较量，心智的角逐，随之展开……','1018','101','100010','201','','')
insert into MovieInformation values('猎凶风河谷BD高清中英双字','凯尔西·周 / 杰瑞米·雷纳 / 茱莉亚·琼斯 / 特欧·布里奥尼斯 / 阿佩萨纳赫克沃特','美国','2017','2017/10/13 0:00:59','故事聚焦雷纳饰演的捕猎者科里协助奥尔森饰演的FBI探员，调查一宗发生在风河谷的少女谋杀案，但是伴随案件侦破，科里悲惨的过往也被残忍掀开……','1019','101','100011','201','','')
insert into MovieInformation values('神奇女侠BD高清中字','盖尔·加朵 / 克里斯·派恩 / 康妮·尼尔森 / 罗宾·怀特 / 丹尼·赫斯顿','美国','2017','2017/8/31 0:02:59','戴安娜（盖尔·加朵 Gal Gadot 饰）是女王希波吕忒（康妮·尼尔森 Connie Nielsen 饰）的女儿，自幼生活在天堂岛上。巨大的屏障将这座岛屿同外界的纷纷扰扰隔开犹如一个世外桃源，而岛上生活着的亦都是女性。在女武官安提奥普（罗宾·莱特 Robin Wright 饰）的教导之下，戴安娜习得了高强的武艺，而她的体内，似乎隐藏着某种强大的未知力量。一场意外中，一位名为史蒂夫（克里斯·派恩 Chris Pine 饰）的男子来到了岛上，从他口中，戴安娜得知外面的世界正在经历战争的磨难，而造成这一切的罪魁祸首，是战神阿瑞斯（大卫·休里斯 David Thewlis 饰）。为了拯救人类于水火之中，戴安娜依然拿起了长剑与盾牌，发誓要彻底摧毁阿瑞斯的阴谋。','1020','101','100012','201','','')
insert into MovieInformation values('加勒比海盗5：死无对证BD高清中字','约翰尼·德普 / 哈维尔·巴登 / 杰弗里·拉什 / 布伦顿·思韦茨 / 卡雅·斯考达里奥','美国','2017','2017/9/8 0:01:38','故事发生在《加勒比海盗3：世界的尽头》沉船湾之战20年后。 男孩亨利（布兰顿·思怀兹 Brenton Thwaites 饰）随英国海军出航寻找被聚魂棺诅咒的父亲“深海阎王”威尔·特纳（奥兰多·布鲁姆 Orlando Bloom 饰），却在百慕大三角遭遇被解封的亡灵萨拉查船长（哈维尔·巴登 Javier Bardem 饰）。获取自由的萨拉查屠尽加勒比海盗，征服了整个海域，手刃了“黑胡子”爱德华·蒂奇（伊恩·麦柯肖恩 Ian McShane 饰）的里海海盗王赫克托·巴博萨船长（杰弗里·拉什 Geoffrey Rush 饰）在女巫Haifaa Meni(格什菲·法拉哈尼 Golshifteh Farahani 饰)口中得知了萨拉查的真实目的：为寻找他的宿敌杰克船长（约翰尼·德普 Johnny Depp 饰）。海盗的命运皆压在落魄的老杰克被封印的黑珍珠号，以及天文学家卡琳娜·史密斯（卡雅·斯考达里奥 Kaya Scodelario 饰）口中的远古三叉戟上。','1021','101','100013','201','','')
insert into MovieInformation values('新木乃伊BD高清中英双字','汤姆·克鲁斯 / 罗素·克劳 / 安娜贝拉·沃丽丝 / 索菲亚·波多拉 / 杰克·约翰逊','美国','2017','2017/8/5 0:03:34','公主阿玛内特穿梭到现代伦敦，企图寻回她曾被夺去的一切。','1022','101','100014','201','','')

--爱情10
insert into MovieInformation values('三生三世十里桃花BD高清国语中字','刘亦菲 / 杨洋 / 罗晋 / 严屹宽 / 李纯','中国','2017','2017/9/5 0:03:22','天族战神墨渊（杨洋 饰）镇压鬼君擎苍（严宽 饰）于无妄海，魂飞魄散，仙体冰封于青丘炎华洞内。青丘帝姬白浅（刘亦菲 饰）同天族太子夜华（杨洋 饰）早有婚约，二人却一直未曾相见。直至东海盛宴，夜华发现白浅竟然同亡妻素素（刘亦菲 饰）相貌一样，就势住进白浅的青丘，放下太子身段，为求解开白浅与素素之谜。夜华侧妃素锦（李纯 饰）生妒，暗中协助鬼族王后玄女（顾璇 饰）抢走墨渊仙体。白浅一怒之下血战鬼族大紫明宫，身负重伤，终被夜华救下。白浅跟随夜华来到九重天，通过天族圣器结魄灯恢复记忆，回想起身为素素一世之时所受伤害，不能原谅夜华。陷害白浅的素锦受到责罚，发配至无妄海，由妒生恨，终至疯狂，利用夜华之子小天孙阿离（彭子苏 饰）之血释放出被墨渊封印的鬼君擎苍。夜华为维护四海八荒，以元神生祭东皇钟，将擎苍封印。世事轮回，万般纠葛不过一个爱字。命运轮回，夜华与白浅究竟何去何从……','1023','103','100015','201','','')
insert into MovieInformation values('二次初恋BD高清国语中字','朱茵 / 杜天皓 / 黄征 / 王志飞 / 王嘉宁','中国','2017','2017/9/30 0:04:28','叶兰（朱茵饰）与路建国（王志飞饰）结婚多年，常常因生活中鸡毛蒜皮的琐事拌嘴，在第20个结婚纪念日，两人终于再起争执闹到离婚，路建国一气之下离家出走并失去联系。此时路建国的侄子路大民（杜天皓饰）却突然出现，打乱了叶兰原本的生活：不仅和路建国儿子路小飞（夏志远饰）成为哥们，并帮他追求心仪的姑娘yoyo(王嘉宁饰)，还把路建国的情敌萧峰(黄征饰)狠狠整蛊了一番。更令叶兰感到奇怪的是，路大民不止长得跟年轻时的路建国一模一样，就连神态动作举手投足也毫无差别，令叶兰产生心动的错觉。而一直没有音讯的路建国也仿佛人间蒸发了一般，直到叶兰看到路大民跳出了只有路建国才会的路式旋转舞……',
'1024','103','100016','201','','')
insert into MovieInformation values('巴塞罗那，冬日星辰BD高清中字','亚历克斯·马朗尼 / 亚历山德拉·希门内斯 / 阿尔维托·圣胡安 / Aina Clotet / Asunción Balaguer','西班牙','2015','2017/9/24 0:02:39','巴塞隆纳的圣诞节，总是带给人们甜蜜与喜乐。查尔斯和罗拉刚拥有第一个爱的结晶，然而，他们很快的理解到，三人的小家庭跟两人世界有巨大的差别。新手爸妈手足无措，只能试著适应全然未知的崩溃生活。 　　卡曼奶奶这里倒是有些新鲜事，她早已计画好要在全家吃耶诞大餐时，宣布自己有了新对象！但那位得到她芳心的人却令人跌破眼镜。而大情圣奥斯卡这次终于不再一股脑倒在哪个女孩的裙襬下了吗？还有乔姆，他心心念念了五十年的初恋女孩，居然再度出现了。圣诞夜的魔力，究竟会带给这些破碎的心什么样的祝福呢？',
'1025','103','100017','201','','')
insert into MovieInformation values('浮生梦2017.BD高清中英双字','山姆·克拉弗林 / 蕾切尔·薇兹 / 伊恩·格雷 / 霍丽迪·格兰杰 / 波佩·李·弗里尔',
'英国','2017','2017/9/3 0:03:17','菲利普·阿什来（山姆·克拉弗林 饰）有一个他非常亲密和热爱的表兄弟，名叫阿姆布罗斯·阿什来，而且，阿姆布罗斯也是一个非常富有的人，但是突然有一天，阿姆布罗斯死去了。菲利普觉得事情有些蹊跷，认为阿姆布罗斯可能是他的妻子雷切尔（蕾切尔·薇兹 饰）所杀，雷谢尔杀死他的目的就是为了继承遗产。于是，他前往阿姆布罗斯的家， 在那里，他碰到了美丽的雷谢尔，却禁不住爱上了这位刚刚守寡的新妇。在爱情的漩涡中，菲利普不再怀疑雷谢尔，并且认为自己以前的怀疑是没有根据的。但是，雷谢尔为什么会爱上菲利普呢？她莫非是想利用菲利普获得他的表兄弟留给她的遗产？雷谢尔会不会再次杀了菲利普？',
'1026','103','100018','201','','')
insert into MovieInformation values('昼行闪耀的流星BD高清中字','永野芽郁 / 三浦翔平 / 白滨亚岚 / 山本舞香 / 佐藤隆太','日本','2017','2017/10/27 0:24:45','与谢野雀是在乡下长大的高中一年级学生。由于父亲去海外工作的缘故，她要去东京和谕吉叔叔一起生活了。上京第一天，她在去叔叔家的途中晕倒，恰巧被路过的狮子尾所救。在去叔叔家的路上，被狮子尾背著的小雀意外地发现狮子尾的脖子上有一颗痣，她不禁把这颗痣与记忆中曾引导迷路的年幼的自己的，那颗闪烁在白天中的星星重叠了起来。 　　就这样，小雀新生活的第一天总算过去了。对接下来的新生活不禁有些期待的她，迎来了转校的第一天。不料却在学校里跟狮子尾重逢。还发现狮子尾竟然是老师，还是自己的班导。而邻座的男生马村对她的态度也十分奇怪，让她很在意。 　　新的环境，新的邂逅，新的友情和恋情。 　　那颗星星究竟是什么，时至今日已经分辨不出，那是梦境还是现实。',
'1027','103','100019','201','','')
insert into MovieInformation values('我爱你2017.BD高清中字','娜塔丽·特纳 / Pol Monen / María Pedraza','西班牙','2017','2017/9/17 0:02:46','劳拉和卡洛斯彼此相爱，好像每一天都是最后一次，也许第一次恋爱的强烈程度会使他们一年后分开。',
'1028','103','100020','201','','')
insert into MovieInformation values('爱爱囧事BD高清国语中字','赵奕欢 / 王一 / 莫熙儿 / 董玉峰 / 陈美行','中国','2013','2017/7/23 0:33:03','的女屌丝，屡次被母亲逼迫去相亲，高富帅上司颜朗（董玉峰 饰）是她的幻想对象。一次巧合，让她遇上了逃婚在外的拥有私人豪华飞机的公子哥展少昂（王一 饰），爱爱误以为他是个身无分文的流浪汉，把他捡回家里开展了一段搞笑的同居生活。与此同时，少昂的父亲雇佣了胡侦探（秦汉擂 饰）调查他的行踪，爱爱与少昂开展了一段段囧事。女屌丝能否逆袭成功就看这次了。',
'1029','103','100021','201','','')
insert into MovieInformation values('与君相恋100次BD高清中字','miwa / 坂口健太郎 / 龙星凉 / 真野惠里菜 / 泉泽祐希','日本','2017','2017/9/26 0:02:42','日向葵海（miwa 饰）和长谷川陆（坂口健太郎 饰）是青梅竹马的好友，两人同朋友松田直哉（龙星凉 饰）和中村铁太（泉泽佑希 饰）一起组建了一支乐队。直哉一直默默喜欢着葵海，他决定在夏日祭上表白自己的心意。然而，葵海的目光却一直追随着冷傲孤僻的陆，在他的温柔和冷漠之中，葵海无法确定自己在他的心中究竟存在于怎样的位置。 　　夏日祭当天，乐队登台演出，心不在焉的葵海在搞砸了整场演出之后死于交通意外。然而当她再度睁开双眼，发现自己竟然回到了一周之前，这不可思议的经历让她发现了陆一直隐藏着的秘密，也令两人之间的关系有了突飞猛进的发展。然而，无论怎样努力，葵海终究会在夏日祭那天傍晚死去，为了将心爱的人留在身边，陆一遍又一遍的穿越着时空。',
'1030','103','100022','201','','')
insert into MovieInformation values('初恋日记BD高清国语中字','王敏奕 / 马志威 / 符龙飞 / 林雪 / 罗家英','香港','2017','2017/10/25 0:04:11','初恋，甜蜜又苦涩。如果第一次恋爱遇到渣男怎么办？查子颀就遇到了。少女时代的她第一次恋爱就遭遇了男友张子豪的劈腿，两人从甜蜜到最后不欢而散。多年后，从清纯玉女蜕变成熟女御姐的查子颀成为一名情感导师，为害怕恋爱以及容易在爱情中受骗的女生讲授恋爱技巧，备受欢迎。而此时，套路满满却不再相信爱情的查子颀，被学生时代曾暗恋过的同学安俊源热切追求着，这位暖男让她重拾对爱情的渴望，正当她决定接受安俊源时，张子豪却再次出现，并表现出对子颀的余情未了，究竟谁才是真爱，查子颀最终又将作出怎样的抉择？',
'1031','103','100023','201','','')
insert into MovieInformation values('秘果BD高清国语中字','陈飞宇 / 欧阳娜娜 / 邹元清 / 张诚航 / 欧豪','中国','2017','2017/9/24 0:08:02','十七岁的男生段柏文（陈飞宇 饰）自幼丧母，与继母矛盾剧烈，敏感坎坷的少年爱上了特立独行的老师“小耳朵”李珥（米咪 饰），这也成为了他心里的秘密。元气少女于池子（欧阳娜娜 饰）心里也有一个秘密，她暗恋着自己的青梅竹马段柏文。可是有一天她发现自己的闺蜜、个性校花斯嘉丽（邹元清 饰）秘密经营着与段柏文的特殊关系，愤怒的她开始了自己的复仇计划……',
'1032','103','100024','201','','')

--战争
insert into MovieInformation values('刺杀盖世太保BD高清中字','杰森·克拉科 / 裴淳华 / 杰克·奥康奈尔 / 米娅·华希科沃斯卡 / 杰克·莱诺','法国','2017','2017/10/14 0:03:30','讲述二战期间纳粹高官莱茵哈特-海德里希(Reinhard Heydrich)的故事。莱茵哈德-海德里希是党卫军的总指挥，也是“最终解决方案”的执行者，有着“纳粹斩首官”之称。但就当海德里希志得意满之时，1942年却被两名英国派遣的 捷克伞兵刺杀，这次刺杀行动由丘吉尔策划，行动代号为猿人。',
'1033','107','100025','201','','')
insert into MovieInformation values('山2.BD高清中英双字','Ozan Aga? / Bedii Akin / Murat Arkin','土耳其','2016','2017/9/30 0:01:20','讲述一支受到严格训练的土耳其特种部队渗透到伊拉克执行救援任务',
'1034','107','100026','201','','')
insert into MovieInformation values('敦刻尔克HDTC清晰首发','菲恩·怀特海德 / 汤姆·格林-卡尼 / 杰克·劳登 / 哈里·斯泰尔斯 / 阿纽林·巴纳德','英国','2017','2017/8/18 0:04:30','故事改编自著名的二战军事事件“敦刻尔克大撤退”。二战初期，40万英法盟军被敌军围困于敦刻尔克的海滩之上，面对敌军步步逼近的绝境，形势万分危急。英国政府和海军发动大批船员，动员人民起来营救军队。 　　英国士兵汤米（菲昂·怀特海德 Fionn Whitehead 饰）在逃离海滩的过程中相继结识吉布森与亚历克斯，同时民用船主道森先生（马克·里朗斯 Mark Rylance 饰）与儿子彼得、17岁少年乔治也离开英国，去往敦刻尔克拯救士兵。三人陆续搭救了海军（基里安·墨菲 Cillian Murphy 饰）、飞行员柯林斯及汤米一行人，而战斗机飞行员法瑞尔（汤姆·哈迪 Tom Hardy 饰）则在被敌人双面夹击的艰难情形下顽强战斗。 　　影片的故事从陆、海、空三个角度讲述，在德国军队的包围下，每个人不得不为自己的命运背水一战，才有可能活着回家。',
'1035','107','100027','201','','')
insert into MovieInformation values('空天猎HDTS清晰国语中字','李晨 / 范冰冰 / 王千源 / 李佳航 / 赵达','中国','2017','2017/10/21 0:04:11','一场空天战场的猎杀传奇。霸天狼，一支神秘的空军顶级团队，每一名飞行员都是“金头盔” 级别的王牌飞行员，吴迪（李晨 饰）、亚莉（范冰冰 饰）、巴图（郭洺宇 饰）、高原（李晨浩 饰）通过层层考核，成为了霸天狼秘密基地的一员。可谁也没有想到，吴迪的好友浩辰（李佳航 饰）却在任务中陷入一场境外战乱的阴谋。更大的威胁接踵而至，恐怖势力突 发其来的导弹危机和人质危机，空前地挑战着中国空军的实战能力!十万火急之下，最新式 的中国战机和最顶级的飞行员，与掌握导弹密码和先进战机的敌人，在境外天空展开一场生死对决......',
'1036','107','100028','201','','')
insert into MovieInformation values('坚不可摧BD高清英语中字','杰·科特尼 加内特·赫德兰 多姆纳尔·格利森 杰克·奥康奈尔','美国','2015','2016/12/7 0:00:40','二次世界大战时，前奥林匹克长跑选手路易·赞贝里尼（杰克·奥康奈尔 Jack O‘Connell 饰）驾驶的战机意外坠毁，路易与其他两位同机组员在海上漂流了47天之后，遭到日本海军长期囚禁，并受其中一位军官渡边长野（石原贵雅 Miyavi 饰）残忍虐待，甚至到战争结束后这个痛苦的梦魇仍挥之不去，他经常作恶梦、酗酒，在看似失去一切的时候，信仰解救了他，他最后更前往日本希望与渡边长野会面，愿意原谅他…… 　　本片由安吉丽娜·朱莉执导并担任制片，改编自前奥运会长跑运动员的路易·赞贝里尼的真实经历，浓缩他从街头顽童、奥运选手以及二战期间个人跌宕起伏的经历，97岁的路易亲自出镜讲解。',
'1037','107','100029','201','','')
insert into MovieInformation values('里普哈根BD高清荷兰语中字','杰罗恩·凡·康宁斯伯格 安娜·拉德斯韦德','荷兰','2016','2016/12/21 0:04:54','关于荷兰二战时期最大的战争犯、犹太人猎人“卡彭”里伐艮的真实故事',
'1038','107','100030','201','','')
insert into MovieInformation values('敌对区域BD高清中英双字','Ariadna Gil / Raúl Mérida / Roberto álam','西班牙','2017','2017/8/3 0:05:45','一架联合国医疗直升机在阿富汗的山区遭遇意外，附近的西班牙军队必须在天黑之前将他们救出塔利班武装的包围之',
'1039','107','100031','201','','')
insert into MovieInformation values('生死之墙BD高清中字','亚伦·泰勒-约翰逊 / 约翰·塞纳 / 莱斯·纳克里','美国','2017','2017/8/10 0:02:34','故事围绕驻扎伊拉克的两名士兵展开，队友受伤，神秘狙击手的穷追不舍，矮墙铸成最后一道生命线。两人将何去何存？一场猫鼠游戏在所难免。',
'1040','107','100032','201','','')
insert into MovieInformation values('血战钢锯岭BD高清中英双字','安德鲁·加菲尔德 / 萨姆·沃辛顿 / 文斯·沃恩 / 雨果·维文 / 卢克·布雷西','美国','2016','2017/2/9 0:35:45','1945年，第二次世界大战接近尾声，作为邪恶轴心重要成员的日本，其嚣张态势已成强弩之末。是年，决定战局走向的冲绳岛战役拉开序幕，成千上万斗志昂扬的美国大兵被派往冲绳，等待他们的则是敌军重兵防守、凶险异常的钢锯岭。在这群人中间，却有一个不愿拿起武器的军医。他名叫戴斯蒙德·道斯（安德鲁·加菲尔德 Andrew Garfield 饰），来自美国的弗吉尼亚。太平洋爆发之际，瘦弱的戴斯蒙德志愿成为救死扶伤的军医而应征入伍。可因童年和家庭的原因，他始终不愿拿起枪支操练，为此宁愿背上拒服兵役的罪名被送上军事法庭。几经周折，戴斯蒙德最终和战友来到了钢锯岭。枪林弹雨，转瞬之间无数人应声倒地。在信仰和信念的支持下，戴斯蒙德仅凭一己之力拯救了数十条濒死的生命…… 　　本片根据真人真事改编。',
'1041','107','100033','201','','')
insert into MovieInformation values('南京东1937.BD1280高清国语中字','林纪/李子涵','大陆','2015','2015/12/9 20:06:25','1929年，年少时的佐藤先生应邀父亲之命，来到中国南京向师傅求学围棋精髓，结识了师傅之女吴花子，两人以棋热恋百年好合，不料几年后中日淞沪会战爆发，日军大举进攻中国首都南京，在城内史无前例的疯狂大屠杀，两个人的命运因这场战争而改变。',
'1042','107','100034','201','','')
insert into MovieInformation values('延坪海战BD1280高清中字延坪海战BD1280高清中字','晋久，李玹雨，金武烈，李莞，李清娥','韩国','2015','2016/2/18 12:36:33','讲述的是2002年6月发生在韩国西海海域上发生的“第2延坪海战”，金武烈将饰演历史上真实存在的人物——延坪海战中以身殉职的海军大尉尹永河。而秦久则饰演战斗到生命最后一刻的中尉韩尚国，兵长朴东赫一角则由李玹雨饰演。',
'1043','107','100035','201','','')
insert into MovieInformation values('百团大战BD1280高清国语中英双字','唐国强，王伍福，陶泽如，刘之冰，印小天','大陆','2015','2015/9/21 17:40:41','1940年，世界反法西斯战场进入最艰难时期。欧洲战场，纳粹军队闪击波兰后，连下荷兰、比利时和卢森堡、挪威。1940年6月14日，号称世界列强之一的法国投降，希特勒在凯旋门前阅兵，叫嚣将实施“海狮行动”，进攻英国。一直支持中国的苏联，为避免两面受敌，只能和日本签署满蒙边界停火协议。而在中国，正面战场上的国民党军队节节败退，为了抵抗日军的进攻，残酷的枣宜会战中，中将张自忠（邓超饰）以身殉国，江汉平原以至华中大部又落入日本人之手。',
'1044','107','100036','201','','')
insert into MovieInformation values('柏林孤影BD高清中英双字','艾玛·汤普森 / 丹尼尔·布鲁赫 / 布莱丹·格里森 / 米卡埃尔·佩斯布兰特 / 卡塔琳娜·舒特勒','德国/法国/英国','2016','2017/2/8 0:30:04','本片由法国家喻户晓的俊男级跨界导演文森特-佩雷斯执导。1964年出生的佩雷斯，在上世纪80、90年代曾红极一时，主演的经典作品包括了《芳芳》《玛戈皇后》等等。佩雷斯很早就显示出了导演方面的才华，1992年和1999年有两部作品入围了戛纳国际电影节的短片单元。2002年，佩雷斯拍出了长片处女作《天使的肌肤》，2007年又执导了《秘密》。本片是佩雷斯投资规模最大，也是第一次入围A类国际电影节主竞赛单元的作品。 　　《柏林孤影》的故事发生在上世纪40年代的柏林。工人阶级夫妇奥托和安娜把自己唯一的独生子送上了战场。不幸的是，儿子在惨烈的战争中身亡。这对夫妇决定用自己的方式反抗纳粹党的极权统治。很快，他们的行动被发现，受到了盖世太保的追捕和威胁。这部以小视角反映大主题的二战题材电影，吸引了不少重量级明星参演。曾以《霍华德庄园》获得奥斯卡最佳女主角奖的英国演技派女演员艾玛-汤普森，出演一个伤心的母亲；曾以《杀手没有假期》获得金球奖最佳男主角提名的布莱丹-格里森，扮演坚强的父亲。曾在《再见列宁》中大放异彩，并以《极速风流》艳惊好莱坞的丹尼尔-布鲁赫，将和两大老戏骨飚戏。',
'1045','107','100037','201','','')
insert into MovieInformation values('比利·林恩的中场战事BD高清中字','乔·阿尔文 / 加内特·赫德兰 / 克里斯汀·斯图尔特 / 范·迪塞尔 / 李淳','美国','2016','2017/2/2 0:29:06','伊拉克战争时期，来自美国德州的19岁技术兵比利·林恩（乔·阿尔文 Joe Alwyn 饰）因为一段偶然拍摄的视频而家喻户晓。那是一次规模不大却激烈非常的遭遇战，战斗中林恩所在的B班班长（范·迪塞尔 Vin Diesel 饰）遭到当地武装分子的伏击和劫持，而林恩为了营救班长不惜铤而走险冲锋陷阵。视频公布于世让他成为全美民众所崇拜的英雄，然而却鲜有人理解他和战友们所经历的一切。为了安葬班长，B班得到了短暂的休假，因此他们得以受邀参加一场在德州举行的橄榄球比赛。林恩的姐姐因某事件深感愧疚，她希望弟弟能借此机缘回归普通生活。而周围的经纪人、球迷、大老板、普通民众则对战争、卫国、士兵有着各种各样想当然的理解。球场上的庆典盛大开幕，林恩和战友们的心却愈加沉重与焦躁……',
'1046','107','100038','201','','')
insert into MovieInformation values('国王的选择BD高清中字','加斯帕·克里斯滕森 / 安德斯·巴斯莫·克里斯蒂安森','挪威','2016','2017/2/8 0:28:45','1940年4月9日，德军兵临奥斯陆，挪威国王面临着一个艰难的选择，这将永远改变他的国家。',
'1047','107','100039','201','','')
insert into MovieInformation values('潘菲洛夫28勇士BD高清中字','Aleksandr Ustyugov / Vitaliy Kovalenko / Aleksey Morozov','俄罗斯','2016','2017/2/1 0:29:07','本片讲述二战中的一个著名故事，苏军潘菲洛夫步兵师的２８名士兵在通往莫斯科的地段上消灭了１８辆德军坦克，阻止了德军前进的步伐，苏军只有５人幸存',
'1048','107','100040','201','','')
insert into MovieInformation values('奇袭胡家台BD1280高清国语中字','周琳娜，赵祖楠，王晞','大陆','2016','2016/1/23 2:57:47','为阻止日军增援，荷花与胡水生用麻袋背鬼子，并与新四军取得联系，对敌人发起袭击。日军依靠民房进行顽抗。荷花点燃民房，新四军发起冲锋，全歼了胡家台的敌人。',
'1049','107','100041','201','','')
insert into MovieInformation values('日本最长的一天BD1280高清中字','役所広司，本木雅弘，松坂桃李，堤真一，山崎努','日本','2015','2016/1/13 3:42:16','役所广司主演电影《日本的最长一天》，故事讲述二战末期联合国要求日本投降否则在本土决战，内阁连日连夜为此议论纷纷，直到广岛长崎发生原爆事态恶化，在让1亿日本国民牺牲的漩涡中，陆军大臣阿南惟几（役所广司），昭和天皇（本木雅弘），首相铃木贯太郎（山崎努），书记官迫水久常（堤真一）在进行是否投降的苦恼决定，另一方面反对投降的畑中少佐（松坂桃李）率领年轻军人进行叛变，准备占领皇居及电台，在终战的前夜发生悲壮的事件。',
'1050','107','100042','201','','')
insert into MovieInformation values('我即闪电BD高清中字','尤塞恩.博尔特','英国','2016','2017/1/25 0:40:04','历史上最快的人的遗产，尤塞恩.博尔特。',
'1051','107','100043','201','','')

--剧情
insert into MovieInformation values('3月的狮子 前篇BD高清中字','神木隆之介 / 有村架纯 / 仓科加奈 / 染谷将太 / 清原果','日本','2017','2017/10/21 0:01:05','17岁的职业将棋手桐山零，年幼时失去亲人，孤独的他在与川本三姐妹的相处中不断成长，逐渐找回了失去的东西。',
'1052','105','100044','201','','')
insert into MovieInformation values('3月的狮子 后篇BD高清中字','神木隆之介 / 有村架纯 / 仓科加奈 / 染谷将太 / 清原果耶','日本','2017','2017/10/28 0:33:13','后篇主要讲述了主人公对“未来”的展望：他将与他所爱的人开始全新的生活。在遇到了邻居家的三姐妹一年后，桐山零的生活已经开始变化，他逐渐意识到了从小被封存于内心的真实的自我。在将棋之外，桐山零开始接触一个崭新而温暖的世界。在将棋比赛中，他与拥有惊人天赋、强烈热衷于将棋的专业选手厮杀，在生活中，他获得了邻居姐妹给予的家的温暖，这样的温暖如同阳光一般照耀着他，桐山零坚冰一样的内心逐渐融化。将棋比赛与温馨家庭，让他在生活充实的同时也学会了爱。',
'1053','105','100045','201','','')
insert into MovieInformation values('1922.BD高清中字','托马斯·简 / 莫莉·帕克 / 尼尔·麦克唐纳 / 布莱恩·达西·詹姆斯 / 迪兰·施密德','美国','2017','2017/10/27 0:21:48','故事讲述了一个简单又骄傲的牧场主，为了经济利益和儿子一起谋杀了妻子。而在埋葬其尸体时，他发现自己被老鼠恐吓，并确信妻子并没有放过他！',
'1054','105','100046','201','','')
insert into MovieInformation values('雌猫们HD高清中字','井端珠里 / 真上五月 / 美知枝 / 音尾琢真 / 郭智','日本','2017','2017/10/20 0:00:39','晚的池袋色彩迷离流莺们无处投宿，白石和弥带着写实主义色彩拍的三个应召女郎，她们身体的喘息就是生活的喘息，日常里她们的眉眼带着大都会的孤独淡漠，每个人都知道自己在沦陷却又无法抽身，偶尔付出感情和收到别人感情，都像借火取暖。波波头女生像新垣结衣。 雌猫们，有要抚养孩子的母亲，有迷失方向的少女。彼此只知道代号这一设定已经表明了人与人之间的冷漠与疏离，开启一道道肉体之门。几个嫖客：内敛的老人，张扬的少者，SM爱好者；芸芸众生，爱欲嗔痴。预算有限而大量使用手提摄影，反倒极佳地营造了卖春的街头感和迷离感。',
'1055','105','100047','201','','')
insert into MovieInformation values('单身骑士BD高清中字','李秉宪 / 孔晓振 / 安昭熙 / 本尼迪克·哈迪 / 杰克·坎贝尔','韩国','2017','2017/10/12 1:34:21','李秉宪将饰演一名精英证券投资银行的分行行长，孔晓振饰演其妻子 　　该剧是一部讲述男主角与儿子、妻子在澳洲旅行时，一瞬间失去了全部的不可思议的悬疑剧。',
'1056','105','100048','201','','')
insert into MovieInformation values('独自在夜晚的海边BD高清中字','金敏喜 / 徐永嬅 / 郑在咏 / 文成根 / 权海骁','韩国','2017','2017/10/19 0:04:17','某外国城市，来自韩国的女演员英熙，正因为和国内一个已婚男子的恋情而备受压力，她放弃了一切，甘受千夫所指以此表明心迹。他说会去找他，但她并不相信。在熟识的朋友家吃过饭，她去了海边。她认为朋友不会理解这段感情，但还是问道：“他会像我思念他一样思念我吗” 　　韩国江陵。几个老朋友的聚会。起初气氛有点尴尬，喝了些酒之后，英熙想吓吓他们。她表现得冷漠又不近人情，但他们反而喜欢这样。酒终人散，英熙独自去了海滩，发泄重重心事似雾般消散。她想知道，爱在生命中到底有多重要？',
'1057','105','100049','201','','')
insert into MovieInformation values('光辉岁月2016.BD高清中字','金志洙 / 金俊勉 / 柳俊烈 / 金喜赞 / 金烔完','韩国','2016','2017/10/27 0:23:12','金志洙 饰）、尚宇（金俊勉 饰）、都满（金喜赞 饰）和智孔（柳俊烈 饰）是从小玩到大的好友，彼此之间感情十分要好。毕业之后，四人选择了各自不同的未来，踏上了属于他们自己的人生旅途。 　　尚宇决定参军入伍，临行之际，几位好友决定结伴来一场释放青春之旅，然而，在旅途中，四人意外邂逅了一名身陷险境的陌生女子。无法对其坐视不管的四人向女子伸出了援手，哪知道竟然被卷入了麻烦之中，成为了警方调查的嫌疑对象，并且将此事告诉了四人各自的父母。在亲人的干预之下，四个年轻人之间开始了相互的猜忌，坚实的友情渐渐产生裂痕。',
'1058','105','100050','201','','')
insert into MovieInformation values('纪念BD高清中字','伊莎贝尔·于佩尔 / 凯文·阿札伊斯 / 约翰·雷森','法国','2016','2017/10/20 0:05:03','Lilian在肉制品加工厂工作，负责将月桂叶加入肝饼中。她曾经以Laura的名字名噪一时，是音乐界一颗冉冉升起的明星，甚至参加过欧洲歌唱大赛。如今她在公寓过着隐居生活，将昔日辉煌抛于身后。但是，22岁的Jean走进了她的生活……',
'1059','105','100051','201','','')
insert into MovieInformation values('局外人2016.BD高清中字','亚瑟·杜彭 / 弗朗索瓦-格扎维埃·德梅松 / 萨巴纳·奥扎尼 / 陶菲克·杰拉巴 / 托马斯·库芒','法国','2016','2017/10/26 0:01:57','电影改编自真实事件，九年前震惊全球的「500亿欧元交易弊案」，描述2008年时，31岁的巴黎交易员杰宏柯维耶在未经授权下进行金融买卖，涉及的投资金额高达500亿欧元，几乎导致法国兴业银行（Société Générale）倒闭，更引发全球金融大暴泻。这位人称「魔鬼交易员」的柯维耶，如何偷天换日、秘密进行500亿欧元的交易？由于金额太过庞大，让人怀疑内情不单纯，不仅国际议论纷纷，更成为金融机构的职训教材。',
'1060','105','100052','201','','')
insert into MovieInformation values('撩乱的裸舞曲BD高清中字','板尾创路 / 芦那堇 / 冈村泉','日本','2016','2017/10/21 0:05:56','谐星板尾创路饰演一位脑闭塞导演，陷入了女色陷阱，搞到身败名裂。',
'1061','105','100053','201','','')
insert into MovieInformation values('莫娣2016.BD高清中字','莎莉·霍金斯 / 伊桑·霍克 / 卡瑞·玛切特 / 加布里埃尔·罗斯 / 扎卡里·贝内特','加拿大','2016','2017/10/28 0:30:07','真人真事改编，描述在加拿大美丽的大西洋省份新斯科舍省（Nova Scotia），一位患有关节炎的民间艺术家莫娣·刘易斯(Maud Lewis)，对艺术不懈的追求，与她的丈夫相识，并以艺术、贩卖作品为生的励志生活。',
'1062','105','100054','201','','')
insert into MovieInformation values('母亲湖BD高清中字','内田朝陽 / 鶴田真由 / 高橋メアリージュン / 木ノ本嶺浩 / 高橋ユウ','日本','2016','2017/10/21 0:15:02','“那天，我们看见的是真实还是虚幻” 　　2036年世界级摄影师藤居亮介回到琵琶湖。他前往博物馆，去看那里展出的恐龙模型。这是过去以“琵琶龙”为原型衍生出来的动物。 　　20年前，11岁的亮介为寻求真相四处奔走。他相信“琵琶龙”是真实存在的。但是亮介已将一切封存心底。',
'1063','105','100055','201','','')
insert into MovieInformation values('纽约唯一活着的男孩BD高清中英双字','凯特·贝金赛尔 / 科雷西·克莱门斯 / 杰夫·布里吉斯 / 卡勒姆·特纳 / 皮尔斯·布鲁斯南','美国','2017','2017/10/28 0:31:38','故事讲述充满文青气质的汤马大学毕业，从父亲的豪宅搬到小区生活，漂流在纽约大都会中，一日，汤马意外发现父亲有外遇，试图出手阻止但却情不自禁投入外遇的怀抱。汤马迷失在了偷情的快感与罪疚之中...',
'1064','105','100056','201','','')
insert into MovieInformation values('杀人者的记忆法BD高清中字','薛耿求 / 金南佶 / 金雪炫 / 吴达洙 / 蔡国熙','韩国','2017','2017/10/23 0:03:13','该片根据同名小说改编，讲述患有阿兹海默症的连续杀人犯炳秀(薛耿求饰)金盆洗手，可村庄却再现连环杀人案，这让炳秀陷入混乱记忆之中。于此同时女儿(金雪炫饰)，神秘男子(金南佶饰)也身陷其中。',
'1065','105','100057','201','','')
insert into MovieInformation values('私人会所BD高清国语中字','冯海锐 / 李任燊 / 汤加文 / 麦子乐 / 陈洁玲','香港','2017','2017/10/29 0:03:23','讲述家境不佳大学生Milo（冯海锐饰）因好友巧盈（陈美伊饰）炒股失利，结果跟巧盈一起到仿如夜总会运作高级私人会所Balcony工作赚钱，在Joey妈（陈洁玲饰）的带领下，与菲菲（汤加文饰）与Sabrina（锺卓菲饰）每晚陪著客人。証券分析员 Steve n（李任燊饰）在工作关系由富二代Lucas（麦子乐饰）带到Balcony，并且认识了庄家伦爷（李凯贤饰）及阿杰（陈咏谦饰）。Stephen首次在Balcony便遇上首天工作的Milo，并且互相发展。考了经纪牌的巧盈则希望能让陈杰开户，而Lucas在不得志下却对Joey妈有感，而伦爷却对菲菲有其好感。不过在股场之下，却隐藏著暗涌，影响众人命运。',
'1066','105','100058','201','','')
insert into MovieInformation values('四十度晒BD高清中英双字','马基斯·帕帕季米特里乌 / Elli Tringou / Milou Van Groesen / Dimi Hart / Hara Kotsali','希腊','2016','2017/10/15 0:57:29','豔夏，陷入中年危机的医生寇斯提斯，在一座希腊小岛迷恋上正值青春年华的病患安娜。她青春无忌，奉行享乐主义，常与友人裸身于海边嬉戏，其随兴不羁的个性深深吸引了已然丧失热情的他，却也因此走入一条欲壑难填的毁灭之路。 　　全然解放的青春胴体映衬著热情旖旎的海岛风光，鲜明地拍出在面临举国破产后，希腊青年的遁世与中年人倏地无力的哀伤。',
'1067','105','100059','201','','')
insert into MovieInformation values('特别市民BD高清中字','崔岷植 / 郭度沅 / 罗美兰 / 沈恩京 / 文素丽','韩国','2017','2017/10/24 0:49:35','《特别市民》讲述了玩弄权力竞选三度连任的现任首尔市长卞钟九，在与罗美兰饰演的竞选对手梁珍珠争夺市长之位的过程中发生的故事，影片直指韩国政坛的丑陋一面。',
'1068','105','100060','201','','')
insert into MovieInformation values('昔日英雄BD高清中英双字','克里斯滕·里特 / 劳拉·普莱潘 / 山姆·艾里奥特 / 尼克·奥弗曼 / 凯瑟琳·罗斯','美国','2017','2017/10/11 0:07:04','一位过气西部片明星的生活日常，平平淡淡却也十分治愈。',
'1069','105','100061','201','','')
insert into MovieInformation values('雪山奇迹BD高清中字','乔什·哈奈特 / 米拉·索维诺 / 莎拉·杜蒙 / Kale Culley / Jason Cottle','美国','2017','2017/10/30 0:04:06','前奥运冰球运动员埃里克·勒马克死里逃生的故事将被搬上大银幕。主演乔什·哈奈特，导演斯科特·沃。埃里克·勒马克在内华达山脉滑雪时由于滑雪板发生故障，被困山中长达八天，最终在搜救队的营救下得以脱险。',
'1070','105','100062','201','','')
insert into MovieInformation values('最后的疯狂2017.BD高清中英双字','海瑟·格拉汉姆 / 约翰·赫德 / Molly C. Quinn / 罗伯特·帕特里克 / 布鲁斯·戴维森','美国','2017','2017/10/22 0:05:08','1978年夏天，由臭名昭著的真实越狱事件改编。罪犯加里·蒂松和兰迪·格里纳沃特，与三个儿子接应，从亚利桑那州立监狱越狱，逃亡新墨西哥州，一路上杀人灭口，最终落入法网。',
'1071','105','100063','201','','')


--恐怖
insert into MovieInformation values('M.F.A.BD高清中英双字','弗朗西斯卡·伊斯特伍德 / 小克利夫顿·克林斯 / 迈克·韦尔奇 / 安德鲁·卡德威尔 / 大卫·苏利文','美国','2017','2017/10/19 0:00:42','故事讲述艺术系女生诺丽遭到同学性侵后，决定正面PK性侵者、展开还击计划。',
'1072','106','100064','201','','')
insert into MovieInformation values('安娜贝尔2：诞生BD高清中英双字','斯黛芬妮·西格曼 / 特丽莎·贝特曼 / 露露·威尔逊 / 米兰达·奥图 / 安东尼·拉帕格利亚','美国','2017','2017/10/14 0:01:44','塞缪尔·穆林斯（安东尼·拉帕格利亚饰）和埃丝特·穆林斯（米兰达·奥图饰）是一对夫妻，他们有个非常可爱的女儿，一家人幸福地生活在美国中西部地区，但随着女儿安娜贝尔（萨玛拉·李饰）在一场车祸中不幸丧生，这个家庭陷入了悲痛之中，穆林斯夫妇也渐渐与世隔绝。 　　多年后，夫妻俩决定把自家的房子用作孤儿院，收留修女夏洛特（斯黛芬尼·西格曼饰）收养的孩子们，名叫J珍妮丝和琳达的小朋友不听劝闯进了安娜贝尔原来的房间，引发了一系列诡异而恐怖的事件 。',
'1073','106','100065','201','','')
insert into MovieInformation values('安全邻域BD高清中英双字','奥利维亚·德容格 / 莱维·米勒 / 艾德·奥克森博尔德 / 戴克·蒙哥马利 / 帕特里克·沃伯顿','美国','2017','2017/10/11 0:00:11','在一个安静的郊区街道上，一个保险公司必须保护一个十二岁的男孩从陌生人进入房屋，只发现这是从正常的家庭入侵的远方。',
'1074','106','100066','201','','')
insert into MovieInformation values('报告老师！怪怪怪怪物！BD高清国语中字','邓育凯 / 陈珮骐 / 梁如瑄 / 蔡凡熙 / 赖浚程','中国','2017','2017/10/24 0:48:05','《怪物》描述邓育凯饰演的好学生长期被班上风云人物三人组作弄，某天四个人意外发现吃人的人形小怪物，进而延伸出“霸凌”议题，此主题也是九把刀十多年前看完瑞典电影《邪恶》受到启发后，一直想探讨的主题。原本他想以1500万台币低成本拍成“霸凌伪纪录片”，后期转变成剧情特效片，不但在中影搭棚，也特地在西门钉封街拍动作戏，制作费提高到一亿台币，大部份成本投入特效制作。九把刀透露，原本电影设定走写实暴力路线，但自己和素人演员无法掌握，最后决定做自己走回黑色幽默风格。',
'1075','106','100067','201','','')
insert into MovieInformation values('残酷的梦BD高清中字','苏菲·奈丽丝 / 乔什·维金斯 / 比尔·帕克斯顿 / 科鲁姆·费奥瑞','加拿大','2016','2017/10/12 1:36:43','農場少年強納斯遇見了新搬來的鄰居凱西，年少輕狂的他們迅速墜入愛河。強納斯卻意外發現凱西擔任地方警察的父親韋恩不但貪汙、瀆職，甚至殺人毫不手軟。一心想保護凱西的強納斯，於是偷了韋恩一袋來路不明的錢，只想著要帶心愛的女孩去到安全的地方，然而那袋疑點重重的錢，讓他們陷入了致命危險…',
'1076','106','100068','201','','')
insert into MovieInformation values('颤栗汪洋3.BD高清中英双字','Suzanne Dervish-Ali / Megan Peta Hill / Joel Hogan / Pete Valley / Tara Wrait','澳大利亚','2017','2017/10/10 0:01:40','三位朋友，拍摄一场极限真人秀的试听带，参加了鲨鱼笼潜水。这很快就会变成一场灾难性的转折，把他们留在巨大的白色出没的水域，把他们的记录变成一本关于生存和死亡的冷血日记。',
'1077','106','100069','201','','')
insert into MovieInformation values('鬼哭神嚎：觉醒BD高清中英双字','贝拉·索恩 / 卡梅隆·莫纳汉 / 詹妮弗·杰森·李 / 泰勒·斯波瑞特勒 / 托马斯·曼','美国','2017','2017/10/8 0:05:00','詹妮弗·杰森·李饰演的单身母亲，带着两个女儿，以及因为一场事故身受重伤，如今躺在床上不省人事的儿子（卡梅隆·莫纳汉），搬进了这栋“非常邪”的房子。恐怖的事情也随之开始，屋中的恶灵似乎盘踞到了昏迷的儿子体内，他忽然苏醒，成了恶鬼用来杀人的工具。',
'1078','106','100070','201','','')
insert into MovieInformation values('鬼声波BD高清中英双字','罗丝·麦高恩 / 克里斯托弗·洛伊德 / 迈克尔·艾克朗德 / 理查德·古恩 / Jane Moffat','加拿大','2017','2017/10/6 0:01:57','超自然现象怀疑论者凯莉·韩森，前往多伦多废弃的下湾地铁站，用低频声波揭穿超自然目击事件，这次恐怕她遇到的不是鬼。',
'1079','106','100071','201','','')
insert into MovieInformation values('黑暗之歌BD高清中英双字','Catherine Walker / 史蒂夫·奥拉姆 / 马克·休伯曼 / 苏珊·洛克南','英国','2016','2017/10/2 0:01:51','失爱子的母亲苏菲亚，亟欲与她遭到谋杀的儿子沟通，便求助于反社会又酗酒的神祕仪式专家约瑟夫。约瑟夫禁不起苏菲亚的苦苦哀求，只好勉为其难地为这位哀痛的母亲降灵。他们两人将自身隔绝在北威尔斯一处杳无人烟的房屋中展开为期半年的严酷黑暗仪式，将身心逼到崩溃的临界点，藉此撕裂通往异界的路径……',
'1080','106','100072','201','','')
insert into MovieInformation values('忌日快乐BD高清中字','杰西卡·罗德 / 伊瑟尔·布罗萨德 / 露比·莫迪恩 / 查尔斯·艾特肯 / 劳拉·克利夫顿','美国','2017','2017/10/30 0:07:17','叙述一名大学生不断重复经历她被人谋杀的当天，包括所有的细节和可怕的死亡结局，直到追查出杀她凶手的真正身份。',
'1081','106','100073','201','','')
insert into MovieInformation values('僵尸集团BD高清中英双字','Raina Hein / Steven Luke / Tony Todd','美国','2017','2017/10/7 0:01:41','全世界陷入混乱，充斥着爆发的僵尸，只有强者才能生存。卢克和他的团队，是否有足够的野心和弹药来延长人类的生存时间？',
'1082','106','100074','201','','')
insert into MovieInformation values('杰罗德游戏BD高清中字','卡拉·古奇诺 / 亨利·托马斯 / 布鲁斯·格林伍德 / 卡雷尔·斯特鲁基 / 凯特·西格尔','美国','2017','2017/10/2 0:03:05','根据斯蒂芬·金小说改编，某天女主角杰西和丈夫杰罗德到乡村别墅度假，丈夫突发奇想要玩一个疯狂的性游戏，结果心脏病突发死亡，而杰西则还被铐在床头不能动弹，面对杰罗德尸体被野狗一块块撕嚼，杰西必须想法脱身',
'1083','106','100075','201','','')
insert into MovieInformation values('辣手保姆BD高清中字','贝拉·索恩 / 罗比·阿美尔 / 犹大·刘易斯 / 艾米丽·阿琳·林德 / 萨玛拉·维文','美国','2017','2017/10/16 0:00:43','故事讲述男孩(刘易斯饰)对新来的性感保姆(维文)产生爱慕之情。可某日保姆将朋友带到家里来后，却触发了一系列残忍的虐杀活动',
'1084','106','100076','201','','')
insert into MovieInformation values('蜜月旅行2016.BD高清中字','Hector Kotsifakis / Paulina Ahmed / Alberto Agnesi','墨西哥','2016','2017/10/30 0:02:07','墨西哥恐怖片，豪尔赫，一个古怪的、孤独的医生，为了让她的女邻居伊莎贝尔成为他的女人，绑架了她并通过各种手段让她服从；但外表往往隐藏着更可怕的真相.......男主豪尔赫、女主伊莎贝尔以及女主的男友之间到底有什么不可告人的秘密？？？？一个男人愿意做任何事情让一个年轻女子无条件地爱他',
'1085','106','100077','201','','')
insert into MovieInformation values('千万别睡着BD高清中英双字','加利·艾尔维斯 / 德瑞·德·玛泰 / 多米尼克·谢尔伍德','美国','2017','2017/10/7 0:04:21','对儿情侣在搬到一件小木屋后，遇到了童年被遗忘的恐怖怪事…',
'1086','106','100078','201','','')
insert into MovieInformation values('人皮脸BD高清中字','斯蒂芬·多尔夫 / 莉莉·泰勒 / 朱利安·科斯托夫 / 詹姆斯·布鲁尔 / Sam Strike','美国','2017','2017/10/25 0:02:18','在这部《德州电锯杀人狂》的前传中，从一所精神病院逃出来的四个暴力的青少年绑架了一名年轻护士，并带着她做公路旅行。为了复仇，一个同样精神错乱的警察追捕着他们，其中一个青少年注定落得悲剧的下场，恐惧将毁掉他的心智，把他变成现在为人所知的人皮脸。',
'1087','106','100079','201','','')
insert into MovieInformation values('十月建造的房屋2.BD高清中英双字','Brandy Schaefer / Zack Andrews / Mikey Roe','美国','2017','2017/10/7 0:05:39','五个鬼屋狂热的朋友们仍在试图从前一个万圣节前夜被蓝骷髅绑架的创伤中恢复过来。他们决定面对恐惧，继续前行，然后回去寻找更多的鬼屋。然而，蓝色的骨架的迹象开始出现…',
'1088','106','100080','201','','')
insert into MovieInformation values('误入魔爪BD高清中英双字','Jordyn Rudolph / Brad Bell / Ryan Rudolph','美国','2017','2017/10/19 0:05:53','四名青少年在一次公路旅行中决定绕道而行，发现自己在肯塔基南部森林深处的鬼屋“万圣节尖叫公园”。在目睹了各种各样的折磨和酷刑之后，他们开始怀疑自己经历的事情是否有点太现实了。在他们知道之前，他们中的每一个人都被俘虏了，并成为他们原本认为可怕的乐趣和游戏的一部分…',
'1089','106','100081','201','','')
insert into MovieInformation values('小丑回魂[韩版]HD标清中英双字','杰顿·李博赫 / 杰里米·雷·泰勒 / 索菲娅·利利斯 / 菲恩·伍法德 / 俦森·雅可布','美国','2017','2017/10/24 0:45:48','因州德瑞镇，是一座籍由伐木业形成的城镇。但从建镇那天起，这里似乎就有一个小丑存在，但他绝非善类，反而以残害儿童为乐。 　　被坏孩子们欺负并称为窝囊废俱乐部的比利、麦克、史坦、贝芙、艾迪、本和瑞奇组成了幸运七人组。比利的弟弟乔治雨天玩耍时撞见小丑，失去了性命。他们从麦克的 家族相册中得知小丑的存在，而小丑也开始威胁孩子们的生命。七人组的孩子为了给乔治报仇，并保护镇上的孩子们，他们决心消灭小丑。经过一番激战，小丑带伤逃遁，三十年后，这个邪恶的魔鬼重返德瑞小镇。',
'1090','106','100082','201','','')
insert into MovieInformation values('许愿BD高清中英双字','乔伊·金 / 瑞恩·菲利普 / 李起弘 / 米切尔·斯莱格特 / 香农·珀瑟','美国','2017','2017/10/6 0:04:45','故事讲述生活灰暗不堪的17岁少女(乔伊·金饰)偶得可以实现7个愿望的神秘盒子，然而女孩每一次许愿都引发了可怕的后果。',
'1091','106','100083','201','','')

go
Create table LinkInformation					--链接表
(
LIID int primary key identity,
ThunderboltLink nvarchar(max),					--迅雷链接
BSL nvarchar(max),								--百度链接
SDLP nvarchar(max),								--百度链接密码
LinkID int not null,							--链接编号
[delete] int not null check([delete]=0),		--删除
StateID int not null check(StateID=0)			--外键
)
insert into LinkInformation values('http://xia5.12345hdhd.com/动作/2017-10/13/[高清电影www.911hdhd.com]侠盗联盟BD高清国语中字.MP4','http://pan.baidu.com/s/1hscRmHe','lqqn','100001','0','')
insert into LinkInformation values('http://xia5.12345hdhd.com/动作/2017-09/26/[高清电影www.911hdhd.com]蜘蛛侠：英雄归来BD高清中英双字.MP4','http://pan.baidu.com/s/1hr9ekdA','apab','100002','0','')
insert into LinkInformation values('http://xia5.12345hdhd.com/动作/2017-10/08/[高清电影www.911hdhd.com]超速驾驶BD高清中英双字.MP4','http://pan.baidu.com/s/1bpARka7','7986','100003','0','')
insert into LinkInformation values('http://xia5.12345hdhd.com/动作/2017-10/08/[高清电影www.911hdhd.com]黑暗塔BD高清中英双字.MP4','http://pan.baidu.com/s/1c1QNSYW','mi6w','100004','0','')
insert into LinkInformation values('http://xia5.12345hdhd.com/动作/2017-10/07/[高清电影www.911hdhd.com]狙击精英：巅峰对决BD高清中英双字.MP4','http://pan.baidu.com/s/1nvBm9JV','veos','100005','0','')
insert into LinkInformation values('http://xia5.12345hdhd.com/动作/2017-09/30/[高清电影www.911hdhd.com]追龙2017.HDTC清晰国语中字.MP4','','','100006','0','')
insert into LinkInformation values('http://xia5.12345hdhd.com/动作/2017-10/06/[高清电影www.911hdhd.com]英伦对决HDTS清晰国语中字.MP4','','','100007','0','')
insert into LinkInformation values('http://xia5.12345hdhd.com/动作/2017-10/08/[高清电影www.911hdhd.com]破·局BD高清国语中字.MP4','http://pan.baidu.com/s/1i5MQhxz','96jh','100008','0','')
insert into LinkInformation values('http://xia5.12345hdhd.com/动作/2017-10/20/[高清电影www.911hdhd.com]美国行动[韩版]HD高清修正中英双字.MP4','http://pan.baidu.com/s/1jHWHW7W','86ll','100009','0','')
insert into LinkInformation values('http://xia5.12345hdhd.com/动作/2017-10/06/[高清电影www.911hdhd.com]心理罪BD高清国语中字.MP4','','','100010','0','')
insert into LinkInformation values('http://xia5.12345hdhd.com/动作/2017-10/11/[高清电影www.911hdhd.com]猎凶风河谷BD高清中英双字.MP4','http://pan.baidu.com/s/1hsH3Cqg','5tlh','100011','0','')
insert into LinkInformation values('http://xia5.12345hdhd.com/动作/2017-08/29/[高清电影www.911hdhd.com]神奇女侠BD高清中字.MP4','http://pan.baidu.com/s/1bzf4Xg','yr0b','100012','0','')
insert into LinkInformation values('http://xia5.12345hdhd.com/动作/2017-09/06/[高清电影www.911hdhd.com]加勒比海盗5：死无对证BD高清中字.MP4','http://pan.baidu.com/s/1mhZtreC','hb4j','100013','0','')
insert into LinkInformation values('http://xia5.12345hdhd.com/动作/2017-08/03/[高清电影www.911hdhd.com]新木乃伊BD高清中英双字.MP4','http://pan.baidu.com/s/1nvn2wmX','rz1w','100014','0','')

insert into LinkInformation values('http://xia5.12345hdhd.com/爱情/2017-09/03/[高清电影www.911hdhd.com]三生三世十里桃花BD高清国语中字.MP4','http://pan.baidu.com/s/1pLcAR0J','rpvc','100015','0','')
insert into LinkInformation values('http://xia5.12345hdhd.com/爱情/2017-09/28/[高清电影www.911hdhd.com]二次初恋BD高清国语中字.MP4','http://pan.baidu.com/s/1qYNXr0C','5gz3','100016','0','')
insert into LinkInformation values('http://xia5.12345hdhd.com/爱情/2017-09/22/[高清电影www.911hdhd.com]巴塞罗那，冬日星辰BD高清中字.MP4','http://pan.baidu.com/s/1gfMn2mf','oslb','100017','0','')
insert into LinkInformation values('http://xia5.12345hdhd.com/爱情/2017-09/01/[高清电影www.911hdhd.com]浮生梦2017.BD高清中英双字.MP4','http://pan.baidu.com/s/1c2s6lhA','02bx','100018','0','')
insert into LinkInformation values('http://xia5.12345hdhd.com/爱情/2017-10/25/[高清电影www.911hdhd.com]昼行闪耀的流星BD高清中字.MP4','http://pan.baidu.com/s/1o8QeEqI','hn97','100019','0','')
insert into LinkInformation values('http://xia5.12345hdhd.com/爱情/2017-09/15/[高清电影www.911hdhd.com]我爱你2017.BD高清中字.MP4','http://pan.baidu.com/s/1pKHCJuN','rwtl','100020','0','')
insert into LinkInformation values('http://xia5.12345hdhd.com/爱情/2017-07/21/[高清电影www.911hdhd.com]爱爱囧事BD高清国语中字.MP4','http://pan.baidu.com/s/1i5Gaaln','8esc','100021','0','')
insert into LinkInformation values('http://xia5.12345hdhd.com/爱情/2017-09/24/[高清电影www.911hdhd.com]与君相恋100次BD高清中字.MP4','http://pan.baidu.com/s/1pLV0ALX','8jes','100022','0','')
insert into LinkInformation values('http://xia5.12345hdhd.com/爱情/2017-10/23/[高清电影www.911hdhd.com]初恋日记BD高清国语中字.MP4','http://pan.baidu.com/s/1sla7Afb','co00','100023','0','')
insert into LinkInformation values('http://xia5.12345hdhd.com/爱情/2017-09/22/[高清电影www.911hdhd.com]秘果BD高清国语中字.MP4','http://pan.baidu.com/s/1qYgD7LM','5zi5','100024','0','')

insert into LinkInformation values('http://xia5.12345hdhd.com/战争/2017-10/12/[高清电影www.911hdhd.com]刺杀盖世太保BD高清中字.MP4','http://pan.baidu.com/s/1hs29EHA','yuht','100025','0','')
insert into LinkInformation values('http://xia5.12345hdhd.com/战争/2017-09/28/[高清电影www.911hdhd.com]山2.BD高清中英双字.MP4','http://pan.baidu.com/s/1eRSLgwq','6zhb','100026','0','')
insert into LinkInformation values('http://xia5.12345hdhd.com/战争/2017-08/16/[高清电影www.911hdhd.com]敦刻尔克HDTC清晰首发.MP4','http://pan.baidu.com/s/1boSRiTh','mla8','100027','0','')
insert into LinkInformation values('http://xia5.12345hdhd.com/战争/2017-10/19/[高清电影www.911hdhd.com]空天猎HDTS清晰国语中字.MP4','','','100028','0','')
insert into LinkInformation values('http://xia4.12345hdhd.com/战争/2016-12/7/[高清电影www.911hdhd.com]坚不可摧BD高清英语中字.MP4','http://pan.baidu.com/s/1eSDSa2I','t6ti','100029','0','')
insert into LinkInformation values('http://xia4.12345hdhd.com/战争/2016-12/21/[高清电影www.911hdhd.com]里普哈根BD高清荷兰语中字.MP4','http://pan.baidu.com/s/1kVI2pRx','03eb','100030','0','')
insert into LinkInformation values('http://xia5.12345hdhd.com/战争/2017-08/01/[高清电影www.911hdhd.com]敌对区域BD高清中英双字.MP4','http://pan.baidu.com/s/1dEFmDW1','fp4h','100031','0','')
insert into LinkInformation values('http://xia5.12345hdhd.com/战争/2017-08/08/[高清电影www.911hdhd.com]生死之墙BD高清中字.MP4','http://pan.baidu.com/s/1jHRomP4','zo71','100032','0','')
insert into LinkInformation values('http://xia4.12345hdhd.com/战争/2017-02/07/[高清电影www.911hdhd.com]血战钢锯岭BD高清中英双字.MP4','http://pan.baidu.com/s/1o7AHaem','i90g','100033','0','')
insert into LinkInformation values('http://xia2.12345hdhd.com/战争/2015-12/08/南京东1937.BD1280高清国语中字-RMDX.rmvb','','','100034','0','')
insert into LinkInformation values('http://xia2.12345hdhd.com/战争/2016-02/17/延坪海战BD1280高清中字.rmvb','','','100035','0','')
insert into LinkInformation values('http://xia1.12345hdhd.com/战争/2015-09/20/百团大战BD1280高清国语中英双字.rmvb','','','100036','0','')
insert into LinkInformation values('http://xia4.12345hdhd.com/战争/2017-02/06/[高清电影www.911hdhd.com]柏林孤影BD高清中英双字.MP4','http://pan.baidu.com/s/1kUKq2gv','7wq3','100037','0','')
insert into LinkInformation values('http://xia4.12345hdhd.com/战争/2017-01/31/[高清电影www.911hdhd.com]比利·林恩的中场战事BD高清中字.MP4','http://pan.baidu.com/s/1c223JJ6','yiji','100038','0','')
insert into LinkInformation values('http://xia4.12345hdhd.com/战争/2017-02/06/[高清电影www.911hdhd.com]国王的选择BD高清中字.MP4','http://pan.baidu.com/s/1jIiFbQA','3g1i','100039','0','')
insert into LinkInformation values('http://xia4.12345hdhd.com/战争/2017-01/30/[高清电影www.911hdhd.com]潘菲洛夫28勇士BD高清中字.MP4','http://pan.baidu.com/s/1hsgGSBi','z8ow','100040','0','')
insert into LinkInformation values('http://xia2.12345hdhd.com/战争/2016-01/22/奇袭胡家台BD1280高清国语中字.rmvb','','','100041','0','')
insert into LinkInformation values('http://xia2.12345hdhd.com/战争/2016-01/12/日本最长的一天BD1280高清中字.rmvb','','','100042','0','')
insert into LinkInformation values('http://xia4.12345hdhd.com/纪录/2017-01/24/[高清电影www.911hdhd.com]我即闪电BD高清中字.MP4','http://pan.baidu.com/s/1eSomqhO','m0hp','100043','0','')

insert into LinkInformation values('http://xia5.12345hdhd.com/剧情/2017-10/19/[高清电影www.911hdhd.com]3月的狮子 前篇BD高清中字.MP4','http://pan.baidu.com/s/1i5qwLpV','rix7','100044','0','')
insert into LinkInformation values('http://xia5.12345hdhd.com/剧情/2017-10/26/[高清电影www.911hdhd.com]3月的狮子 后篇BD高清中字.MP4','http://pan.baidu.com/s/1eSrjirK','od36','100045','0','')
insert into LinkInformation values('http://xia5.12345hdhd.com/剧情/2017-10/25/[高清电影www.911hdhd.com]1922.BD高清中字.MP4','http://pan.baidu.com/s/1boJzywB','jfhv','100046','0','')
insert into LinkInformation values('http://xia5.12345hdhd.com/剧情/2017-10/18/[高清电影www.911hdhd.com]雌猫们HD高清中字.MP4','http://pan.baidu.com/s/1boAB1IR','jknh','100047','0','')
insert into LinkInformation values('http://xia5.12345hdhd.com/剧情/2017-10/10/[高清电影www.911hdhd.com]单身骑士BD高清中字.MP4','http://pan.baidu.com/s/1qXD8sfq','1mtw','100048','0','')
insert into LinkInformation values('http://xia5.12345hdhd.com/剧情/2017-10/17/[高清电影www.911hdhd.com]独自在夜晚的海边BD高清中字.MP4','http://pan.baidu.com/s/1o8E8WaQ','b2ai','100049','0','')
insert into LinkInformation values('http://xia5.12345hdhd.com/剧情/2017-10/25/[高清电影www.911hdhd.com]光辉岁月2016.BD高清中字.MP4','http://pan.baidu.com/s/1pL81GAf','7bwd','100050','0','')
insert into LinkInformation values('http://xia5.12345hdhd.com/剧情/2017-10/18/[高清电影www.911hdhd.com]纪念BD高清中字.MP4','http://pan.baidu.com/s/1kVd1vGr','2du6','100051','0','')
insert into LinkInformation values('http://xia5.12345hdhd.com/剧情/2017-10/24/[高清电影www.911hdhd.com]局外人2016.BD高清中字.MP4','http://pan.baidu.com/s/1i5mZkep','i0hk','100052','0','')
insert into LinkInformation values('http://xia5.12345hdhd.com/剧情/2017-10/19/[高清电影www.911hdhd.com]撩乱的裸舞曲BD高清中字.MP4','http://pan.baidu.com/s/1i5te4UL','5itn','100053','0','')
insert into LinkInformation values('http://xia5.12345hdhd.com/剧情/2017-10/26/[高清电影www.911hdhd.com]莫娣2016.BD高清中字.MP4','http://pan.baidu.com/s/1i5h9EPf','2j4t','100054','0','')
insert into LinkInformation values('http://xia5.12345hdhd.com/剧情/2017-10/19/[高清电影www.911hdhd.com]母亲湖BD高清中字.MP4','http://pan.baidu.com/s/1nvmkSgL','ri3q','100055','0','')
insert into LinkInformation values('http://xia5.12345hdhd.com/剧情/2017-10/26/[高清电影www.911hdhd.com]纽约唯一活着的男孩BD高清中英双字.MP4','http://pan.baidu.com/s/1mirCRNi','jmxl','100056','0','')
insert into LinkInformation values('http://xia5.12345hdhd.com/剧情/2017-10/21/[高清电影www.911hdhd.com]杀人者的记忆法BD高清中字.MP4','http://pan.baidu.com/s/1qYr42rM','3pm9','100057','0','')
insert into LinkInformation values('http://xia5.12345hdhd.com/剧情/2017-10/27/[高清电影www.911hdhd.com]私人会所BD高清国语中字.MP4','http://pan.baidu.com/s/1gfF3IKF','q896','100058','0','')
insert into LinkInformation values('http://xia5.12345hdhd.com/剧情/2017-10/13/[高清电影www.911hdhd.com]四十度晒BD高清中英双字.MP4','http://pan.baidu.com/s/1bIeOhg','zl0j','100059','0','')
insert into LinkInformation values('http://xia5.12345hdhd.com/剧情/2017-10/22/[高清电影www.911hdhd.com]特别市民BD高清中字.MP4','http://pan.baidu.com/s/1slSGsW1','t2of','100060','0','')
insert into LinkInformation values('http://xia5.12345hdhd.com/剧情/2017-10/09/[高清电影www.911hdhd.com]昔日英雄BD高清中英双字.MP4','http://pan.baidu.com/s/1qYFQsWk','sdbd','100061','0','')
insert into LinkInformation values('http://xia5.12345hdhd.com/剧情/2017-10/28/[高清电影www.911hdhd.com]雪山奇迹BD高清中字.MP4','http://pan.baidu.com/s/1i55qrUP','aoo9','100062','0','')
insert into LinkInformation values('http://xia5.12345hdhd.com/剧情/2017-10/20/[高清电影www.911hdhd.com]最后的疯狂2017.BD高清中英双字.MP4','http://pan.baidu.com/s/1pLuovpT','lllt','100063','0','')

insert into LinkInformation values('http://xia5.12345hdhd.com/恐怖/2017-10/17/[高清电影www.911hdhd.com]M.F.A.BD高清中英双字.MP4','http://pan.baidu.com/s/1i5jBfCT','ijkw','100064','0','')
insert into LinkInformation values('http://xia5.12345hdhd.com/恐怖/2017-10/12/[高清电影www.911hdhd.com]安娜贝尔2：诞生BD高清中英双字.MP4','http://pan.baidu.com/s/1i5eRflN','yfvl','100065','0','')
insert into LinkInformation values('http://xia5.12345hdhd.com/恐怖/2017-10/09/[高清电影www.911hdhd.com]安全邻域BD高清中英双字.MP4','http://pan.baidu.com/s/1gfrgudH','kkav','100066','0','')
insert into LinkInformation values('http://xia5.12345hdhd.com/恐怖/2017-10/22/[高清电影www.911hdhd.com]报告老师！怪怪怪怪物！BD高清国语中字.MP4','http://pan.baidu.com/s/1jHNoFMQ','qdyt','100067','0','')
insert into LinkInformation values('http://xia5.12345hdhd.com/恐怖/2017-10/10/[高清电影www.911hdhd.com]残酷的梦BD高清中字.MP4','http://pan.baidu.com/s/1pLG81sv','05or','100068','0','')
insert into LinkInformation values('http://xia5.12345hdhd.com/恐怖/2017-10/08/[高清电影www.911hdhd.com]颤栗汪洋3.BD高清中英双字.MP4','http://pan.baidu.com/s/1jISnJZg','p3r8','100069','0','')
insert into LinkInformation values('http://xia5.12345hdhd.com/恐怖/2017-10/06/[高清电影www.911hdhd.com]鬼哭神嚎：觉醒BD高清中英双字.MP4','http://pan.baidu.com/s/1bpq8rYf','1kai','100070','0','')
insert into LinkInformation values('http://xia5.12345hdhd.com/恐怖/2017-10/04/[高清电影www.911hdhd.com]鬼声波BD高清中英双字.MP4','http://pan.baidu.com/s/1clk00Y','apfv','100071','0','')
insert into LinkInformation values('http://xia5.12345hdhd.com/恐怖/2017-09/30/[高清电影www.911hdhd.com]黑暗之歌BD高清中英双字.MP4','http://pan.baidu.com/s/1jIzhhIY','io73','100072','0','')
insert into LinkInformation values('http://xia5.12345hdhd.com/恐怖/2017-10/28/[高清电影www.911hdhd.com]忌日快乐BD高清中字.MP4','http://pan.baidu.com/s/1bozMGJt','fv3b','100073','0','')
insert into LinkInformation values('http://xia5.12345hdhd.com/恐怖/2017-10/05/[高清电影www.911hdhd.com]僵尸集团BD高清中英双字.MP4','http://pan.baidu.com/s/1c1MJUko','0jw7','100074','0','')
insert into LinkInformation values('http://xia5.12345hdhd.com/恐怖/2017-09/30/[高清电影www.911hdhd.com]杰罗德游戏BD高清中字.MP4','http://pan.baidu.com/s/1jHO9uQE','z84t','100075','0','')
insert into LinkInformation values('http://xia5.12345hdhd.com/恐怖/2017-10/14/[高清电影www.911hdhd.com]辣手保姆BD高清中字.MP4','http://pan.baidu.com/s/1jIswsWu','b7kv','100076','0','')
insert into LinkInformation values('http://xia5.12345hdhd.com/恐怖/2017-10/28/[高清电影www.911hdhd.com]蜜月旅行2016.BD高清中字.MP4','http://pan.baidu.com/s/1gfy8NOR','eu87','100077','0','')
insert into LinkInformation values('http://xia5.12345hdhd.com/恐怖/2017-10/05/[高清电影www.911hdhd.com]千万别睡着BD高清中英双字.MP4','http://pan.baidu.com/s/1c19mLjy','shht','100078','0','')
insert into LinkInformation values('http://xia5.12345hdhd.com/恐怖/2017-10/23/[高清电影www.911hdhd.com]人皮脸BD高清中字.MP4','http://pan.baidu.com/s/1qY4vPrI','5u4m','100079','0','')
insert into LinkInformation values('http://xia5.12345hdhd.com/恐怖/2017-10/05/[高清电影www.911hdhd.com]十月建造的房屋2.BD高清中英双字.MP4','http://pan.baidu.com/s/1bFw5TO','1rnm','100080','0','')
insert into LinkInformation values('http://xia5.12345hdhd.com/恐怖/2017-10/17/[高清电影www.911hdhd.com]误入魔爪BD高清中英双字.MP4','http://pan.baidu.com/s/1jIL2Kw2','ip6y','100081','0','')
insert into LinkInformation values('http://xia5.12345hdhd.com/恐怖/2017-10/22/[高清电影www.911hdhd.com]小丑回魂[韩版]HD标清中英双字.MP4','http://pan.baidu.com/s/1miiPoJA','ie0e','100082','0','')
insert into LinkInformation values('http://xia5.12345hdhd.com/恐怖/2017-10/04/[高清电影www.911hdhd.com]许愿BD高清中英双字.MP4','http://pan.baidu.com/s/1i4WIYsH','2iey','100083','0','')

go

create proc vw_TypeInformation
as
select * from dbo.MovieInformation t left join dbo.LinkInformation s on t.StateID=s.StateID left join dbo.Type j on t.StateID=j.StateID
go
exec vw_TypeInformation


go

--存储过程(查询什么类型电影
create proc vw_StatuaryHallselect
@StateName nvarchar output
as
select * from dbo.Type t inner join dbo.MovieInformation m on t.StatNameID=m.StataNameID where StateName = @StateName
go

--多表连接
create proc vw_StatuaryHallinnerjoin
as
select * from dbo.Type t inner join dbo.MovieInformation m on t.StatNameID=m.StataNameID
inner join dbo.LinkInformation l on m.StateID =l.StateID
go
--排
create proc vw_selectMovieDesc
as
select * from dbo.MovieInformation ORDER BY UpdateDate DESC
go
exec vw_selectMovieDesc




--分页

select top(10) * from dbo.MovieInformation where MIID not in (select top(10)*1*3 MIID from dbo.MovieInformation  ORDER BY MIID)
GO
select * from dbo.MovieInformation
go
select top(10*2) * from dbo.MovieInformation Order by MIID
go
alter PROC P_CutPage
@PageSize int,
@PageIndex int,
@PageCount int output
as
	declare @pagesCount decimal
	select top(@PageSize) * from dbo.MovieInformation where MIID not in (select top(@PageSize*(@PageIndex-1)) MIID from dbo.MovieInformation  ORDER BY MIID)
	select @pagesCount=(count(*)/@PageSize) from dbo.MovieInformation
	if @PagesCount%@PageSize<>0
		set	@pageCount=@PagesCount+1
	else
		set	@pageCount=@PagesCount
GO
declare @pageCOUNT int
exec P_CutPage 10,108,@pageCOUNT output
select @pageCOUNT


go

Create table dbo.Statetable										--类型表
(
ID int primary key identity(1,1),
State nvarchar(20) not null,						--类型名称
MIID int not null,									--类型编号
[delete] int not null check([delete]=0),				--删除
StateID int not null check(StateID=0)					--外键
)
insert into dbo.Statetable values('高清中英双字','201','0','')
insert into dbo.Statetable values('清晰中字','202','0','')
insert into dbo.Statetable values('中字','203','0','')
insert into dbo.Statetable values('标准清晰版','204','0','')
go

create view vw_MovieType
as
select b.*,c.StateName,p.[State],k.ThunderboltLink,k.BSL,k.SDLP
from MovieInformation b inner join [Type] c
on b.StateNameID = c.MIID inner join Statetable p
on b.Statname = p.MIID inner join LinkInformation k
on b.LinkID = k.LinkID 
GO
select * from movieInformation


--create table 

--PictureNumber int not null,					--图片编号
--StateNameID int not null,					--类型编号
--LinkID int not null,						--链接编号
--Statname int not null,						--状态编号



--ThunderboltLink nvarchar(max),					--迅雷链接
--BSL nvarchar(max),								--百度链接
--SDLP nvarchar(max),								--百度链接密码




go
CREATE PROC PROC_CutPageSelectByTop
@Table nvarchar(256),
@PageSize int,
@PageIndex int,
@Conditions nvarchar(300),
@UniqueColumn nvarchar(256),
@Pages int output
as
DECLARE @Context nvarchar(1024)
SET @Context='SELECT * INTO #TEMP FROM '+@Table 
IF(@Conditions IS NOT NULL AND @Conditions<>'')
	SET @Context=@Context+' WHERE '+@Conditions
SET @Context=@Context+'  SELECT TOP '+CAST(@PageSize AS nvarchar(4))+' * FROM #TEMP WHERE '+@UniqueColumn+' NOT IN(SELECT TOP '+CAST(@PageSize*(@PageIndex-1) AS nvarchar(4))+' '+@UniqueColumn+' FROM #TEMP)'
SET @Context=@Context+'  DECLARE @count INT  SELECT @count=count(*) FROM #TEMP SET @Pages=@count/'+cast(@PageSize as nvarchar(4))+'  if(@count%'+cast(@PageSize as nvarchar(4))+'<>0)SET @Pages=@Pages+1';
EXEC SP_EXECUTESQL @CONTEXT,N'@Pages int output',@Pages output
GO

--调用存储过程
DECLARE @Pages int
exec PROC_CutPageSelectByTop 'dbo.MovieInformation',10,18,'MIID=20','MIID',@Pages output
select @Pages

go
CREATE PROC vw_Name
@name nvarchar(250),
@names nvarchar(250)
as
select * from dbo.MovieInformation where MovieName='@name' and Performer='@names'
go



CREATE PROC vw_Name
@nameps nvarchar(250)
as
select MovieName,PictureNumber from dbo.MovieInformation where StateNameID='@nameps'
go



SELECT *FROM dbo.MovieInformation ORDER BY UpdateDate ASC


go
select * from dbo.MovieInformation order by UpdateDate desc















































